cases/uniformPhaseChange/0.org/A.steam
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      kappa.steam;
}

dimensions      [0 -1 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    empties
    {
        type            empty;
    }

}

sources
{
    phaseChange
    {
        type            interfacialGrowthMoment;
    }
}
