cases/uniformPhaseChange/0.org/N.steam
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      lambda.steam;
}

dimensions      [0 -3 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    empties
    {
        type            empty;
    }
}

sources
{
    phaseChange
    {
        type            interfacialGrowthMoment;
    }
}
