cases/uniformPhaseChange/0.org/T.steam
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.steam;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 373.15;

boundaryField
{
    empties
    {
        type            empty;
    }
}
