cases/uniformPhaseChange/0.org/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    empties
    {
        type            empty;
    }
}
