cases/uniformPhaseChange/constant/fvModels
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}

phaseChange
{
    type            heatTransferLimitedPhaseChange;
    libs            ("libLogMoM.so");

    phases          (steam water);

    energySemiImplicit yes;
    pressureImplicit no;

    saturationTemperature
    {
        type            constant;
        value           373.15;
    }
}
