cases/uniformPhaseChange/constant/momentumTransfer
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransfer;
}

drag
{
    steam_dispersedIn_water
    {
        type            SchillerNaumann;
        residualRe      1e-3;
    }
}

virtualMass
{}

lift
{}

wallLubrication
{}

turbulentDispersion
{}
