cases/uniformPhaseChange/constant/turbulenceProperties.steam
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties.steam;
}

simulationType  laminar;
