cases/uniformPhaseChange/system/probes
probes
{
    type                probes;
    functionObjectLibs  ("libsampling.so");

    writeControl        timeStep;
    writeInterval       1;

    probeLocations
    (
        (0.5 0.5 0.5)
    );

    fields
    (
        N.steam
        A.steam
        alpha.steam
        p
        T.steam
        T.water
    );
}
